Revit 2024 API
ForgeTypeId.TypeId Property
 The schema identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public string TypeId { get; set; }
Visual Basic
Public Property TypeId As String
	Get
	Set
Visual C++
public:
property String^ TypeId {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace